START_MESSAGE = (
    "Привіт, {name}!\n"
    "Я бот, який допоможе тобі відстежувати твої вхідні транзакції в BSC.\n"
    "Для початку роботи, тобі потрібно надіслати адресу свого гаманця.\n"
)

SEND_WALLET_ADDRESS_BUTTON = "Надіслати адресу гаманця"

WALLET_INPUT_MESSAGE = (
    "Відправ мені адресу свого гаманця, щоб я міг відстежувати твої вхідні транзакції.\n"
    "Адреса гаманця повинна починатися з 0x."
)
WALLET_INPUT_ERROR_MESSAGE = (
    "Неправильний формат адреси гаманця.\n"
    "Надішли мені адресу гаманця, щоб я міг відстежувати твої вхідні транзакції.\n"
)
WALLET_INPUT_SUCCESS_MESSAGE = "Гаманець успішно додано.\n"

SETTINGS_MESSAGE = "Тут ти можеш налаштувати бота.\n"
